pictgram/app/controllers/comments_controller.rb

  def create
    @topic = Topic.find(params[:topic_id])
---
SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1