pictgram/app/controllers/favorites_controller.rb

  def create
    favorite = Favorite.new
    favorite.user_id = current_user.id
    favorite.topic_id = params[:topic_id]

    binding.pry

    if favorite.save
---
INSERT INTO `favorites` (`user_id`, `topic_id`, `created_at`, `updated_at`) VALUES (17, 2, '2018-10-10 17:12:19', '2018-10-10 17:12:19')