pictgram/app/controllers/topics_controller.rb

SELECT `topics`.* FROM `topics`
---
  def index
    @topics = Topic.all.includes(:favorite_users)

INSERT INTO `topics` (`user_id`, `description`, `image`, `created_at`, `updated_at`) VALUES (17, 'test', 'DSC_0108.JPG', '2018-10-10 15:56:35', '2018-10-10 15:56:35')
---
  def create
    @topic = current_user.topics.new(topic_params)

    if @topic.save