pictgram/app/views/topics/index.html.erb

SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`topic_id` IN (1, 2, 3, 4)
---
            <%= image_tag topic.image.url %>
            <% if !topic.favorite_users.include?(current_user) %>

SELECT `comments`.* FROM `comments` WHERE `comments`.`topic_id` IS NULL
---
             <h2>コメント一覧</h2>
             <% @topic.comments.each do |comment| %>